// zadanie 5.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

include<iostream>
#include<cmath>
#include <random>
#include <ctime>
using namespace std;
int main()
{

	int a, b, c, d, a1 = 0, b1 = 0, c1 = 0, d1 = 0;
	srand((int)time(0));
	a = rand() % 10 + 0;
	b = rand() % 10 + 0;
	c = rand() % 10 + 0;
	d = rand() % 10 + 0;
	cout << "Parol`: " << a;
	cout << b;
	cout << c;
	cout << d << endl;
	while (a1 != a) {
		a1++;
	}
	while (b1 != b) {
		b1++;
	}
	while (c1 != c) {
		c1++;
	}
	while (d1 != d) {
		d1++;
	}
	cout << "Sgenerirovannyy parol': " << a1;
	cout << b1;
	cout << c1;
	cout << d1;
	return 0;
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
