// задание 3.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>
using namespace std;

int main()

{
    setlocale(LC_ALL, "Rus");
    int Number, AmountOfNumber, Divider;
    cout << "введите натуральное число n:";
    cin >> Number;
    cout << "введите натуральное число k:";
    cin >> AmountOfNumber;
    Divider = 1;
    while ((Number / Divider) >= 1)
    {

        Divider *= 10;
    }
    Divider = Divider / 10;
    while (AmountOfNumber >= 1)
    {
        cout << (Number / Divider) % 10;
        Divider /= 10;
        AmountOfNumber--;
    }
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
